app/Filters/Auth.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Please login to access this page');
        }

        // Check if user is active
        $userModel = new \App\Models\UserModel();
        $user = $userModel->find(session()->get('user_id'));