app/Controllers/Admin.php

SELECT *
FROM `backup_logs`
ORDER BY `created_at` DESC
 LIMIT 50
---
    public function backup()
    {
        $backups = $this->backupLogModel->orderBy('created_at', 'DESC')->findAll(50);