app/Controllers/Dashboard.php

SELECT *
FROM `products`
WHERE `deleted_at` IS NULL
AND `products`.`deleted_at` IS NULL
SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
AND products.quantity <= products.minimum_stock
AND `products`.`deleted_at` IS NULL
SELECT *
FROM `products`
WHERE `deleted_at` IS NULL
AND `quantity` <= 0
AND `products`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `categories`
WHERE `deleted_at` IS NULL
AND `categories`.`deleted_at` IS NULL
---
    private function getInventorySummary()
    {
        $allProducts = $this->productModel->where('deleted_at', null)->findAll();
        $lowStockItems = $this->productModel
            ->where('products.deleted_at', null)
            ->where('products.quantity <= products.minimum_stock', null, false)
            ->findAll();
        $outOfStockItems = $this->productModel
            ->where('deleted_at', null)
            ->where('quantity <=', 0)
            ->findAll();

        $totalUnits = 0;
        foreach ($allProducts as $product) {
            $totalUnits += (float) ($product['quantity'] ?? 0);
        }

        return [
            'total_products' => count($allProducts),
            'total_categories' => $this->categoryModel->where('deleted_at', null)->countAllResults(),
            'total_units_in_stock' => $totalUnits,
            'low_stock_count' => count($lowStockItems),
            'out_of_stock_count' => count($outOfStockItems),
        ];

SELECT COUNT(*) AS `numrows`
FROM `customers`
WHERE `deleted_at` IS NULL
AND `customers`.`deleted_at` IS NULL
---
    private function getRelationshipSummary()
    {
        return [
            'customers' => $this->customerModel->where('deleted_at', null)->countAllResults(),
            'suppliers' => $this->countTableRows('suppliers'),
            'active_users' => $this->countTableRows('users', ['is_active' => 1, 'deleted_at' => null]),
        ];

SELECT COUNT(*) AS `numrows`
FROM `expenses`
WHERE `expense_date` >= '2026-03-03'
AND `expense_date` <= '2026-04-01'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `production_jobs`
WHERE `production_date` >= '2026-03-03'
AND `production_date` <= '2026-04-01'
AND `deleted_at` IS NULL
AND `status` = 'Completed'
SELECT COUNT(*) AS `numrows`
FROM `purchases`
WHERE `purchase_date` >= '2026-03-03'
AND `purchase_date` <= '2026-04-01'
AND `deleted_at` IS NULL
AND `status` = 'Received'
SELECT COUNT(*) AS `numrows`
FROM `sales`
WHERE `sale_date` >= '2026-03-03'
AND `sale_date` <= '2026-04-01'
AND `deleted_at` IS NULL
---
    private function getActivitySummary($startDate, $endDate)
    {
        return [
            'sales_count' => $this->countByDateRange('sales', 'sale_date', $startDate, $endDate, ['deleted_at' => null]),
            'expense_count' => $this->countByDateRange('expenses', 'expense_date', $startDate, $endDate, ['deleted_at' => null]),
            'purchase_count' => $this->countByDateRange('purchases', 'purchase_date', $startDate, $endDate, ['deleted_at' => null, 'status' => 'Received']),
            'production_count' => $this->countByDateRange('production_jobs', 'production_date', $startDate, $endDate, ['deleted_at' => null, 'status' => 'Completed']),
            'draft_production_jobs' => $this->countTableRows('production_jobs', ['deleted_at' => null, 'status' => 'Draft']),
            'draft_purchases' => $this->countTableRows('purchases', ['deleted_at' => null, 'status' => 'Draft']),
        ];

SELECT `sale_date`, `currency`, `total_amount`
FROM `sales`
WHERE `deleted_at` IS NULL
AND `sale_date` >= '2026-03-16'
AND `sale_date` <= '2026-04-14'
AND `sales`.`deleted_at` IS NULL
---
    private function getFinancialTrend($startDate, $endDate)
    {
        $buckets = $this->buildTimeBuckets($startDate, $endDate);
        $series = [
            'sales_lrd' => array_fill(0, count($buckets['items']), 0),
            'sales_usd' => array_fill(0, count($buckets['items']), 0),
            'expenses_lrd' => array_fill(0, count($buckets['items']), 0),
            'expenses_usd' => array_fill(0, count($buckets['items']), 0),
        ];

        $bucketIndex = [];
        foreach ($buckets['items'] as $index => $bucket) {
            $bucketIndex[$bucket['key']] = $index;
        }

        $sales = $this->saleModel
            ->select('sale_date, currency, total_amount')
            ->where('deleted_at', null)
            ->where('sale_date >=', $startDate)
            ->where('sale_date <=', $endDate)
            ->findAll();

SELECT `expense_date`, `currency`, `amount`
FROM `expenses`
WHERE `deleted_at` IS NULL
AND `expense_date` >= '2026-03-16'
AND `expense_date` <= '2026-04-14'
AND `expenses`.`deleted_at` IS NULL
---
            $series[$dataset][$bucketIndex[$key]] += (float) $sale['total_amount'];
        }

        $expenses = $this->expenseModel
            ->select('expense_date, currency, amount')
            ->where('deleted_at', null)
            ->where('expense_date >=', $startDate)
            ->where('expense_date <=', $endDate)
            ->findAll();

SELECT *
FROM `categories`
WHERE `deleted_at` IS NULL
AND `categories`.`deleted_at` IS NULL
SELECT *
FROM `products`
WHERE `deleted_at` IS NULL
AND `category_id` = '2'
AND `products`.`deleted_at` IS NULL
---
    private function getCategorySnapshot()
    {
        $categories = $this->categoryModel->where('deleted_at', null)->findAll();
        $snapshot = [];

        foreach ($categories as $category) {
            $products = $this->productModel
                ->where('deleted_at', null)
                ->where('category_id', $category['id'])
                ->findAll();

SELECT `products`.`id`, `products`.`product_name`, SUM(sale_items.quantity) as total_quantity, COUNT(DISTINCT sale_items.sale_id) as invoice_count
FROM `sale_items`
JOIN `sales` ON `sales`.`id` = `sale_items`.`sale_id`
JOIN `products` ON `products`.`id` = `sale_items`.`product_id`
WHERE `sales`.`deleted_at` IS NULL
AND `sales`.`sale_date` >= '2026-03-16'
AND `sales`.`sale_date` <= '2026-04-14'
GROUP BY `sale_items`.`product_id`, `products`.`product_name`, `products`.`id`
ORDER BY `total_quantity` DESC
 LIMIT 8
---
    private function getTopProducts($startDate, $endDate)
    {
        $db = \Config\Database::connect();

        return $db->table('sale_items')
            ->select('products.id, products.product_name, SUM(sale_items.quantity) as total_quantity, COUNT(DISTINCT sale_items.sale_id) as invoice_count')
            ->join('sales', 'sales.id = sale_items.sale_id')
            ->join('products', 'products.id = sale_items.product_id')
            ->where('sales.deleted_at', null)
            ->where('sales.sale_date >=', $startDate)
            ->where('sales.sale_date <=', $endDate)
            ->groupBy('sale_items.product_id, products.product_name, products.id')
            ->orderBy('total_quantity', 'DESC')
            ->limit(8)
            ->get()
            ->getResultArray();

SELECT `id`, `invoice_number`, `customer_name`, `total_amount`, `currency`, `payment_status`, `created_at`, `sale_date`
FROM `sales`
WHERE `deleted_at` IS NULL
AND `sale_date` >= '2026-03-16'
AND `sale_date` <= '2026-04-14'
AND `sales`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 6
SELECT `id`, `purchase_number`, `supplier_name`, `total_amount`, `currency`, `payment_status`, `created_at`, `purchase_date`
FROM `purchases`
WHERE `deleted_at` IS NULL
AND `purchase_date` >= '2026-03-16'
AND `purchase_date` <= '2026-04-14'
AND `purchases`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 6
---
    private function getRecentTransactions($startDate, $endDate)
    {
        $entries = [];

        $sales = $this->saleModel
            ->select('id, invoice_number, customer_name, total_amount, currency, payment_status, created_at, sale_date')
            ->where('deleted_at', null)
            ->where('sale_date >=', $startDate)
            ->where('sale_date <=', $endDate)
            ->orderBy('created_at', 'DESC')
            ->findAll(6);

        foreach ($sales as $sale) {
            $entries[] = [
                'date' => $sale['created_at'],
                'module' => 'Sales',
                'reference' => $sale['invoice_number'],
                'party' => $sale['customer_name'] ?: 'Walk-in Customer',
                'amount' => (float) $sale['total_amount'],
                'currency' => $sale['currency'],
                'status' => $sale['payment_status'],
                'link' => base_url('sales/view/' . $sale['id']),
            ];
        }

        $purchases = $this->purchaseModel
            ->select('id, purchase_number, supplier_name, total_amount, currency, payment_status, created_at, purchase_date')
            ->where('deleted_at', null)
            ->where('purchase_date >=', $startDate)
            ->where('purchase_date <=', $endDate)
            ->orderBy('created_at', 'DESC')
            ->findAll(6);

SELECT `expenses`.`id`, `expenses`.`amount`, `expenses`.`currency`, `expenses`.`created_at`, `expenses`.`expense_date`, `expense_categories`.`category_name`
FROM `expenses`
LEFT JOIN `expense_categories` ON `expense_categories`.`id` = `expenses`.`expense_category_id`
WHERE `expenses`.`deleted_at` IS NULL
AND `expense_date` >= '2026-03-16'
AND `expense_date` <= '2026-04-14'
AND `expenses`.`deleted_at` IS NULL
ORDER BY `expenses`.`created_at` DESC
 LIMIT 6
---
            ];
        }

        $expenses = $this->expenseModel
            ->select('expenses.id, expenses.amount, expenses.currency, expenses.created_at, expenses.expense_date, expense_categories.category_name')
            ->join('expense_categories', 'expense_categories.id = expenses.expense_category_id', 'left')
            ->where('expenses.deleted_at', null)
            ->where('expense_date >=', $startDate)
            ->where('expense_date <=', $endDate)
            ->orderBy('expenses.created_at', 'DESC')
            ->findAll(6);

SELECT `products`.`id`, `products`.`product_name`, `products`.`quantity`, `products`.`minimum_stock`, `units`.`unit_name`, `units`.`unit_symbol`
FROM `products`
LEFT JOIN `units` ON `units`.`id` = `products`.`unit_id`
WHERE `products`.`deleted_at` IS NULL
AND products.quantity <= products.minimum_stock
AND `products`.`deleted_at` IS NULL
ORDER BY `products`.`quantity` ASC
 LIMIT 10
---
    private function getLowStockItemsDetailed()
    {
        return $this->productModel
            ->select('products.id, products.product_name, products.quantity, products.minimum_stock, units.unit_name, units.unit_symbol')
            ->join('units', 'units.id = products.unit_id', 'left')
            ->where('products.deleted_at', null)
            ->where('products.quantity <= products.minimum_stock', null, false)
            ->orderBy('products.quantity', 'ASC')
            ->findAll(10);