app/Controllers/Inventory.php

SELECT *
FROM `suppliers`
WHERE `suppliers`.`deleted_at` IS NULL
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
SELECT *
FROM `units`
---
    public function editProduct($id)
    {
        $product = $this->productModel->getProductWithRelations($id);

        if (!$product) {
            if ($this->request->isAJAX()) {
                return $this->response->setJSON(['status' => 'error', 'message' => 'Product not found']);
            }
            return redirect()->to('/inventory/products')->with('error', 'Product not found');
        }

        if ($this->request->isAJAX()) {
            $data = [
                'product' => $product,
                'categories' => $this->categoryModel->findAll(),
                'units' => $this->unitModel->findAll(),
                'suppliers' => $this->supplierModel->findAll()
            ];
            return $this->response->setJSON($data);
        }

        $data = [
            'title' => 'Edit Product',
            'product' => $product,
            'categories' => $this->categoryModel->findAll(),
            'units' => $this->unitModel->findAll(),
            'suppliers' => $this->supplierModel->findAll(),
            'activePage' => 'inventory'
        ];