app/Models/AdjustmentEventModel.php

    public function getSummary($startDate, $endDate)
    {
        $builder = $this->db->table('adjustment_events')
            ->select('event_type, COUNT(*) as event_count, SUM(total_value) as total_value')
            ->where('adjustment_events.deleted_at', null);

        if ($startDate && $endDate) {
            $builder->where('adjustment_events.event_date >=', $startDate);
            $builder->where('adjustment_events.event_date <=', $endDate);
        }

        $rows = $builder->groupBy('event_type')->get()->getResultArray();
---
SELECT `event_type`, COUNT(*) as event_count, SUM(total_value) as total_value
FROM `adjustment_events`
WHERE `adjustment_events`.`deleted_at` IS NULL
AND `adjustment_events`.`event_date` >= '2026-03-16'
AND `adjustment_events`.`event_date` <= '2026-04-14'
GROUP BY `event_type`