app/Models/AuditLogModel.php

INSERT INTO `audit_logs` (`user_id`, `action`, `entity`, `ip_address`, `user_agent`, `new_data`) VALUES ('1', 'backup_create', 'Backup', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36 Edg/146.0.0.0', '{\"filename\":\"backup_2026-04-14_14-06-51.sql\",\"size\":85297}')
---
        $builder = $db->table($this->table);

        try {
            return $builder->insert($data);