app/Models/BackupLogModel.php

    public function insert($data = null, bool $returnID = true)
    {
        if (!is_array($data)) {
            return false;
        }

        $insertData = [
            'backup_type' => $this->normalizeBackupType($data['backup_type'] ?? 'Manual'),
            'backup_file' => (string) ($data['backup_file'] ?? ''),
            'backup_size' => isset($data['backup_size']) ? (int) $data['backup_size'] : null,
            'status' => ($data['status'] ?? 'Success') === 'Failed' ? 'Failed' : 'Success',
            'message' => isset($data['message']) ? (string) $data['message'] : null,
            'created_by' => isset($data['created_by']) ? (int) $data['created_by'] : null,
            'created_at' => date('Y-m-d H:i:s'),
        ];

        $builder = $this->db->table($this->table);
        $result = $builder->insert($insertData);
---
INSERT INTO `backup_logs` (`backup_type`, `backup_file`, `backup_size`, `status`, `message`, `created_by`, `created_at`) VALUES ('Manual', 'backup_2026-04-14_14-06-51.sql', 85297, 'Success', 'Backup created successfully', 1, '2026-04-14 14:06:51')