app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `user_id` = '1'
AND `is_read` = 0
ORDER BY `created_at` DESC
---
    public function getUnread($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();