app/Models/PermissionModel.php

SELECT *
FROM `permissions`
---
    public function syncSystemPermissions()
    {
        $catalog = $this->getPermissionCatalog();
        $existingPermissions = $this->findAll();