app/Models/ProductModel.php

SELECT `products`.*, `categories`.`category_name`, `units`.`unit_name`, `units`.`unit_symbol`, `suppliers`.`supplier_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
LEFT JOIN `units` ON `units`.`id` = `products`.`unit_id`
LEFT JOIN `suppliers` ON `suppliers`.`id` = `products`.`supplier_id`
WHERE `products`.`id` = '12'
---
    public function getProductWithRelations($productId)
    {
        $builder = $this->builder();
        $builder->select('products.*, categories.category_name, units.unit_name, units.unit_symbol, suppliers.supplier_name');
        $builder->join('categories', 'categories.id = products.category_id', 'left');
        $builder->join('units', 'units.id = products.unit_id', 'left');
        $builder->join('suppliers', 'suppliers.id = products.supplier_id', 'left');
        $builder->where('products.id', $productId);

        return $builder->get()->getRowArray();