app/Models/UserModel.php

UPDATE `users` SET `remember_token` = NULL, `remember_token_expiry` = NULL, `updated_at` = '2026-04-01 18:55:52'
WHERE `users`.`id` IN ('1')
---
    public function clearRememberToken($userId)
    {
        return parent::update($userId, [
            'remember_token' => null,
            'remember_token_expiry' => null,
        ]);